УТ/src/Catalogs/Партнеры/Партнеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Партнеры</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>НашеПредприятие</name>
      <description>Наше предприятие</description>
    </items>
    <items>
      <name>НеизвестныйПартнер</name>
      <description>Неизвестный партнер</description>
    </items>
    <items>
      <name>РозничныйПокупатель</name>
      <description>Розничный покупатель</description>
    </items>
  </predefined>
  <attributes>
    <name>БизнесРегион</name>
    <comment>Используется для группировки по территориальному признаку</comment>
    <type>
      <types>CatalogRef.БизнесРегионы</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.ГруппыДоступаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <comment>Используется при анализе первичного интереса</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <comment>Клиенты</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <comment>Поставщики</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Публичное наименование, например, для печати или устного обращения.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойМенеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Конкурент</name>
    <comment>Конкуренты</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрочиеОтношения</name>
    <comment>Прочие отношения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбслуживаетсяТорговымиПредставителями</name>
    <comment>Обслуживаются торговыми представителями</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <comment>Перевозчики</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЭтикетки</name>
    <type>
      <types>CatalogRef.ШаблоныЭтикетокИЦенников</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.КомпанияЧастноеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПереработчика</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОтправкиЭлектронногоЧека</name>
    <type>
      <types>EnumRef.ВариантыОтправкиЭлектронногоЧекаПокупателю</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаДоставки</name>
    <type>
      <types>CatalogRef.ЗоныДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндивидуальныйВидЦены</name>
    <comment>Уточняющий или индивидуальный вид цены</comment>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Автор</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Важность</name>
    <comment>Важность клиента</comment>
    <type>
      <types>CatalogRef.CRM_ВажностьКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Имя</name>
    <comment>Имя клиента</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_НапоминатьОДнеРождения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОсновнаяОтрасль</name>
    <type>
      <types>CatalogRef.CRM_Отрасли</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОсновноеКонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОсновнойАдрес</name>
    <type>
      <types>CatalogRef.CRM_АдресаОфисовКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОтписалсяОтEmailРассылок</name>
    <comment>Отписался от рассылок</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Отчество</name>
    <comment>Отчество клиента частное лицо</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Потенциал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СегментРынка</name>
    <comment>Сегмент рынка клиента</comment>
    <type>
      <types>CatalogRef.CRM_СегментыРынка</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СтатусРаботы</name>
    <comment>Статус работы с клиентом</comment>
    <type>
      <types>CatalogRef.CRM_СтатусыРаботыСКлиентом</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ТипОтношенийПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Фамилия</name>
    <comment>Фамилия клиента частное лицо</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ФизЛицо</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Фотография</name>
    <comment>Фотография клиента частное лицо</comment>
    <type>
      <types>CatalogRef.ПартнерыПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ЧисленностьРабочихМест</name>
    <comment>Численность рабочих мест клиента</comment>
    <type>
      <types>CatalogRef.CRM_ЧисленностьРабочихМестКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ЧисленностьСотрудников</name>
    <comment>Численность сотрудников клиента</comment>
    <type>
      <types>CatalogRef.CRM_ЧисленностьСотрудниковКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>сфпCoMagicID</name>
    <comment>Идентификатор контакта в системе CoMagic</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>сфпПользовательДляПереключенияЗвонков</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_Госорганы</name>
    <comment>Клиент является государственной организацией</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьCRM_Учредитель</name>
    <comment>Клиент является учредителем</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>CRM_ОсновнойДляСвязи</name>
      <comment>Основной вид контактной информации для связи</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>сфпВремяЗадержкиНабораДобавочногоНомера</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>сфпПрефиксНабора</name>
      <type>
        <types>CatalogRef.сфпПрефиксыИсходящихВызовов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_ВидыДеятельности</name>
    <attributes>
      <name>ВидДеятельности</name>
      <type>
        <types>CatalogRef.CRM_Отрасли</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>CatalogRef.КонтактныеЛицаПартнеров</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_ДополнительнаяИнформация</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРегистрации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_Теги</name>
    <attributes>
      <name>Тег</name>
      <type>
        <types>CatalogRef.CRM_Теги</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_ТипыОтношений</name>
    <attributes>
      <name>ТипОтношений</name>
      <type>
        <types>CatalogRef.CRM_ТипыОтношений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ/src/CommonModules/CRM_СобытияФорм/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Содержит события форм, вызываемые на сервере
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Функция, вызываемая из одноименного обработчика события формы.
//
// Параметры:
//  Форма					 - ФормаКлиентскогоПриложения	 - форма, из обработчика события которой происходит вызов процедуры.
//  Отказ					 - Булево			 - признак отказа от создания формы.
//  СтандартнаяОбработка	 - Булево			 - признак выполнения стандартной (системной) обработки события
//  ДополнительныеПараметры	 - Структура		 - дополнительные параметры.
//
// Возвращаемое значение:
//	Булево - результат выполнения.
//
Функция ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры = Неопределено) Экспорт

	// +Рабочий стол
	СписокДоступныхФормРабочегоСтола = CRM_РабочийСтолСервер.ПолучитьСписокДоступныхФорм();
	
	Если СписокДоступныхФормРабочегоСтола.НайтиПоЗначению(Форма.ИмяФормы) <> Неопределено Тогда
		CRM_РабочийСтолСервер.ПриСозданииНаСервере(Форма, Отказ);
	КонецЕсли;
	// -Рабочий стол
	
	// +Доступные пользователи
	Если ДополнительныеПараметры = Неопределено
		ИЛИ НЕ ДополнительныеПараметры.Свойство("ОтключитьОграничениеПоПользователям") Тогда
		УстановитьОграниченияПоПользователям(Форма, , ДополнительныеПараметры);
	КонецЕсли;
	// -Доступные пользователи
	
	Если СтрНайти(Форма.ИмяФормы, "CRM_") > 0
		И ПолучитьФункциональнуюОпцию("CRM_ИспользоватьНапоминанияПользователя") Тогда
		
		Кнопка = Форма.Элементы.Найти("ФормаОбщаяКомандаНапомнить");
		Если Кнопка <> Неопределено Тогда
			Кнопка.Видимость = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		Группа = Форма.Элементы.Найти("ГруппаКомманднаяПанельПодменюОтчетыСмТакже");
		Если Группа <> Неопределено Тогда
			Группа.Видимость = Ложь;
		КонецЕсли;
		Группа = Форма.Элементы.Найти("ПодменюОтчетыСмТакже");
		Если Группа <> Неопределено Тогда
			Группа.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "Объект") 
		И ТипЗнч(Форма.Объект) = Тип("ДанныеФормыСтруктура")
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Объект, "Ссылка") Тогда
		 
		Если ЗначениеЗаполнено(Форма.Объект.Ссылка)
			И CRM_БизнесПроцессыСервер.ОбъектСвязанСБизнесПроцессом(Форма.Объект.Ссылка) Тогда
			CRM_БизнесПроцессыСервер.ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка);
		КонецЕсли;
		
		CRM_ТриггерыСервер.ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка);

		CRM_ТрудозатратыСервер.ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка);
	КонецЕсли;
	
	Если НЕ CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		
		Если Форма.ИмяФормы = "Документ.ЗаказКлиента.Форма.ФормаДокумента" Тогда
			
			МодульРаботаСФормамиСервер = ОбщегоНазначения.ОбщийМодуль("CRM_МетодыФормДокументовСервер");
			МодульРаботаСФормамиСервер.СоздатьНеобходимыеРеквизитыИЭлементыДляГруппыИнтерес(Форма);
			
		ИначеЕсли Форма.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаЭлемента" Тогда
			CRM_КлассификаторыЭкспортныеМетоды.ДобавитьЗакладкуКлассификацияВТиповуюФорму(Форма);
			// / Классификаторы
			Если НЕ Форма.Элементы.Найти("СтраницыКарточкаНоменклатуры") = Неопределено Тогда
				Форма.Элементы.ГруппаКлассификация.Видимость = ПолучитьФункциональнуюОпцию("CRM_ИспользоватьКлассификаторы");
			КонецЕсли;
		ИначеЕсли Форма.ИмяФормы = "Справочник.Партнеры.Форма.ФормаВыбораБезПолнотекстовогоПоиска" Тогда
			Если Форма.Параметры.Свойство("Отбор")
				И Форма.Параметры.Отбор.Свойство("ЮрФизЛицо")
				И Форма.Параметры.Отбор.ЮрФизЛицо = Перечисления.КомпанияЧастноеЛицо.Компания
				И СтрНайти(Форма.Список.ТекстЗапроса, "Контрагенты.ЮрФизЛицо") > 0 Тогда
				Форма.Параметры.Отбор.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо;
			КонецЕсли;
		КонецЕсли;
		
		// +CRM_Модуль
		ГруппаСвязанныеСписки = Форма.Элементы.Найти("ГруппаСвязанныеСписки");
		Если ПолучитьФункциональнуюОпцию("ИспользоватьИнциденты") И Не ГруппаСвязанныеСписки = Неопределено Тогда
			
			ТипЗначенияОбъекта = ТипЗнч(Форма.Объект.Ссылка);
			
			// Добавить кнопку на форму
			Если Метаданные.ОпределяемыеТипы.ПредметИнцидента.Тип.СодержитТип(ТипЗначенияОбъекта) Тогда
				
				КомандаФормы = Форма.Команды.Добавить("ОбщаяКомандаИнцидентыПоПредмету");
				КомандаФормы.Действие = "Подключаемый_ИнцидентыПоПредмету";
				КомандаФормы.Заголовок = НСтр("ru = 'Инциденты'");
				КомандаФормы.ИзменяетСохраняемыеДанные = Ложь;
				
				НовыйЭлемент = Форма.Элементы.Добавить("КнопкаИнцидентыПоПредмету", Тип("КнопкаФормы"), ГруппаСвязанныеСписки);
				НовыйЭлемент.Вид = ВидКнопкиФормы.Гиперссылка;
				НовыйЭлемент.ИмяКоманды = "ОбщаяКомандаИнцидентыПоПредмету";
				НовыйЭлемент.ЦветТекста = ЦветаСтиля.CRM_ОсновнойГолубой;
				
				ЭлементВложения = Форма.Элементы.Найти("ВложенияПредставление");
				Если Не ЭлементВложения = Неопределено Тогда
					Форма.Элементы.Переместить(НовыйЭлемент, ЭлементВложения.Родитель, ЭлементВложения);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		// -CRM_Модуль
		
		Если Форма.Параметры.Свойство("ПолучитьИмяРеквизитаСписка") Тогда
			
			// найдем реквизит списка
			
			МассивРеквизитыФормы = Форма.ПолучитьРеквизиты();
			
			ИмяРеквизитаСписка = "";
			
			ИмяПервогоДинамическогоСписка = "";
			
			Для Каждого РеквизитФормы Из МассивРеквизитыФормы Цикл
				
				// проверим, является ли реквизит динамическим списком
				
				МассивТипов = РеквизитФормы.ТипЗначения.Типы();
				
				Для Каждого ТипРеквизита Из МассивТипов Цикл
					
					Если ТипРеквизита = Тип("ДинамическийСписок") Тогда
						
						Если ПустаяСтрока(ИмяПервогоДинамическогоСписка) Тогда
							
							ИмяПервогоДинамическогоСписка = РеквизитФормы.Имя;
							
						КонецЕсли;
							
						Если СтрНайти(РеквизитФормы.Имя, "Список") > 0 Тогда
							
							ИмяРеквизитаСписка = РеквизитФормы.Имя;
							
							Прервать;
							
						КонецЕсли;
					
					КонецЕсли;
					
				КонецЦикла;
					
				Если Не ПустаяСтрока(ИмяРеквизитаСписка) Тогда
					
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если ПустаяСтрока(ИмяРеквизитаСписка) Тогда
				
				ИмяРеквизитаСписка = ИмяПервогоДинамическогоСписка;
				
			КонецЕсли;	
			
			// добавим реквизит для обмена с формами выбора документов
			
			ДобавляемыеРеквизиты = Новый Массив; 
			Реквизит = Новый РеквизитФормы("ИмяРеквизитаСписка", Новый ОписаниеТипов("Строка")); 
			ДобавляемыеРеквизиты.Добавить(Реквизит); 
			Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
			
			Если НЕ ПустаяСтрока(ИмяРеквизитаСписка) Тогда
				
				Форма["ИмяРеквизитаСписка"] = ИмяРеквизитаСписка;
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	CRM_МодификацияКонфигурацииПереопределяемый.ПриСозданииНаСервере(Форма.ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
	Возврат Истина;
КонецФункции

// Процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
//	Форма					- ФормаКлиентскогоПриложения - форма, из обработчика события которой происходит вызов процедуры.
//	ТекущийОбъект			- Объект - объект, который будет прочитан.
//	ДополнительныеПараметры - Структура - дополнительные параметры.
//
Процедура ПриЧтенииНаСервере(Форма, ТекущийОбъект, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "Объект") 
		И ТипЗнч(Форма.Объект) = Тип("ДанныеФормыСтруктура")
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Объект, "Ссылка") Тогда
		Если CRM_БизнесПроцессыСервер.ОбъектСвязанСБизнесПроцессом(Форма.Объект.Ссылка) Тогда
			CRM_БизнесПроцессыСервер.ПриЧтенииНаСервере(Форма, ТекущийОбъект, ДополнительныеПараметры);
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		Если Форма.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаЭлемента" Тогда
			CRM_КлассификаторыЭкспортныеМетоды.ФормаОбъектаПриЧтенииНаСервере(Форма, Форма.Объект.Ссылка);
		КонецЕсли;
	КонецЕсли;
	
	CRM_МодификацияКонфигурацииПереопределяемый.ПриЧтенииНаСервере(Форма, ТекущийОбъект);
	
КонецПроцедуры

// Переопределяемая процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - Форма, из обработчика события которой происходит вызов процедуры.
//  Отказ			 - Булево - Отказ.
//  ТекущийОбъект	 - ЛюбойТип - Текущий объект.
//  ПараметрыЗаписи	 - Структура - Параметры записи.
//
Процедура ПередЗаписьюНаСервере(Форма, Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "Объект") 
		И ТипЗнч(Форма.Объект) = Тип("ДанныеФормыСтруктура")
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Объект, "Ссылка") Тогда
		CRM_ТриггерыСервер.ПередЗаписьюНаСервере(Форма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "CRM_ТаблицаИнтересов") Тогда
		МодульРаботаСФормамиСервер = ОбщегоНазначения.ОбщийМодуль("CRM_МетодыФормДокументовСервер");
		МодульРаботаСФормамиСервер.ПередЗаписьюНаСервере(Форма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;
	
	CRM_МодификацияКонфигурацииПереопределяемый.ПередЗаписьюНаСервере(Форма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

// Переопределяемая процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - Форма, из обработчика события которой происходит вызов процедуры.
//  ТекущийОбъект	 - ЛюбойТип - Текущий объект.
//  ПараметрыЗаписи	 - Структура - Параметры записи.
//
Процедура ПослеЗаписиНаСервере(Форма, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "Объект") 
		И ТипЗнч(Форма.Объект) = Тип("ДанныеФормыСтруктура")
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Объект, "Ссылка") Тогда
		Если CRM_БизнесПроцессыСервер.ОбъектСвязанСБизнесПроцессом(Форма.Объект.Ссылка) Тогда
			CRM_БизнесПроцессыСервер.ПослеЗаписиНаСервере(Форма, ТекущийОбъект, ПараметрыЗаписи);
		КонецЕсли;
		CRM_ТриггерыСервер.ПослеЗаписиНаСервере(Форма, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;
	
	CRM_МодификацияКонфигурацииПереопределяемый.ПослеЗаписиНаСервере(Форма, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

#КонецОбласти
